kendryte/arduino-k210/cores/k210/k210-sdk/drivers/k210_kpu.c
static void kpu_logistic(const kpu_model_logistic_layer_argument_t *arg, kpu_model_context_t *ctx)
{
    const float *src = (const float *)(ctx->main_buffer + arg->main_mem_in_address);
    float *dest = (float *)(ctx->main_buffer + arg->main_mem_out_address);
    size_t oc, channels = arg->channels;

    for (oc = 0; oc < channels; oc++)
        dest[oc] = 1.f / (1.f + expf(-src[oc]));
}

static void kpu_conv(const kpu_model_conv_layer_argument_t *arg, kpu_model_context_t *ctx)
{
    volatile kpu_layer_argument_t layer = *(const volatile kpu_layer_argument_t *)(ctx->model_buffer + arg->layer_offset);
    layer.kernel_load_cfg.data.para_start_addr = (uintptr_t)(ctx->model_buffer + arg->weights_offset);
    layer.kernel_pool_type_cfg.data.bwsx_base_addr = (uintptr_t)(ctx->model_buffer + arg->bn_offset);
    layer.kernel_calc_type_cfg.data.active_addr = (uintptr_t)(ctx->model_buffer + arg->act_offset);

    if (arg->flags & KLF_MAIN_MEM_OUT)
    {
        dmac_channel_number_t dma_ch = ctx->dma_ch;
        uint8_t *dest = ctx->main_buffer + arg->main_mem_out_address;
        kpu->interrupt_clear.data = (kpu_config_interrupt_t)
        {
            .calc_done_int = 1,
            .layer_cfg_almost_empty_int = 1,
            .layer_cfg_almost_full_int = 1
        };
        kpu->interrupt_mask.data = (kpu_config_interrupt_t)
        {
            .calc_done_int = 1,
            .layer_cfg_almost_empty_int = 1,
            .layer_cfg_almost_full_int = 1
        };
        layer.dma_parameter.data.send_data_out = 1;
        sysctl_dma_select((sysctl_dma_channel_t)dma_ch, SYSCTL_DMA_SELECT_AI_RX_REQ);
        if (ctx->current_layer != ctx->layers_length)
            dmac_irq_register(dma_ch, ai_step, ctx, 1);
        else
            dmac_irq_register(dma_ch, (plic_irq_callback_t)kpu_kmodel_done, ctx, 1);
        dmac_set_single_mode(dma_ch, (void *)(&kpu->fifo_data_out), dest, DMAC_ADDR_NOCHANGE, DMAC_ADDR_INCREMENT,
            DMAC_MSIZE_8, DMAC_TRANS_WIDTH_64, (layer.dma_parameter.data.dma_total_byte + 8) / 8);
    }
    else
    {
        kpu->interrupt_clear.data = (kpu_config_interrupt_t)
        {
            .calc_done_int = 1,
            .layer_cfg_almost_empty_int = 1,
            .layer_cfg_almost_full_int = 1
        };

        kpu->interrupt_mask.data = (kpu_config_interrupt_t)
        {
            .calc_done_int = 0,
            .layer_cfg_almost_empty_int = 1,
            .layer_cfg_almost_full_int = 1
        };
        layer.interrupt_enabe.data.int_en = 1;
    }

    kpu_send_layer((const kpu_layer_argument_t *)&layer);
}

static void kpu_add_padding(const kpu_model_add_padding_layer_argument_t *arg, kpu_model_context_t *ctx)
{
    const uint8_t *src = (const uint8_t *)(ctx->main_buffer + arg->main_mem_in_address);
#if USE_CACHED_AI_RAM
    uint8_t *dest = (uint8_t *)(uintptr_t)(AI_RAM_BASE_ADDR + arg->kpu_mem_out_address * 64);
#else
    uint8_t *dest = (uint8_t *)(uintptr_t)(AI_IO_BASE_ADDR + arg->kpu_mem_out_address * 64);
#endif

    uint32_t row_padding = 16;
    uint32_t row_group = 4;
    uint32_t row_length = 1;
    uint32_t height = 4;
    uint32_t oc, x, y, channels = arg->channels;

    for (oc = 0; oc < channels; oc++)
    {
        uint8_t *channel_origin = dest + oc / row_group * row_length * height * 64 + oc % row_group * row_padding;
        for (y = 0; y < 1; y++)
        {
            uint8_t *y_origin = channel_origin + y * row_length * 64;
            for (x = 0; x < 1; x++)
                y_origin[x] = *src++;
        }
    }

#if USE_CACHED_AI_RAM
    uint32_t lines = row_length * height * channels / row_group;
    kpu_flush_cache(arg->kpu_mem_out_address, lines);
#endif
}

static void kpu_remove_padding(const kpu_model_remove_padding_layer_argument_t *arg, kpu_model_context_t *ctx)
{
    const uint8_t *src = (const uint8_t *)(ctx->main_buffer + arg->main_mem_in_address);
    uint8_t *dest = (uint8_t *)(ctx->main_buffer + arg->main_mem_out_address);
    uint32_t oc, channels = arg->channels;

    for (oc = 0; oc < channels; oc++)
        *dest++ = src[oc * 16];
}

static void kpu_upload(const kpu_model_upload_layer_argument_t *arg, kpu_model_context_t *ctx)
{
    size_t width = arg->width;
    size_t height = arg->height;
    size_t channels = arg->channels;

    kpu_upload_core(width, height, channels, ctx->main_buffer + arg->main_mem_in_address, arg->kpu_mem_out_address);
}

static void kpu_prealloc_for_fully_conn_layer(kpu_model_context_t *ctx)
{
    kpu_model_layer_header_t *hdr = NULL;
    kpu_model_fully_connected_layer_argument_t *layer = NULL;

    const uint8_t *body = ctx->body_start;

    uint32_t ic, oc, max_ic = 0, max_oc = 0, ioc_mut = 0;

    for(uint32_t id = 0; id < ctx->layers_length; id++) {
        hdr = (kpu_model_layer_header_t *)(ctx->layer_headers + id);
        if(KL_FULLY_CONNECTED == hdr->type) {
            layer = (kpu_model_fully_connected_layer_argument_t *)body;

            ic = layer->in_channels;
            oc = layer->out_channels;

            if(ic * oc > ioc_mut) {
                max_ic = ic;
                max_oc = oc;
                ioc_mut = ic * oc;
            }

            //rt_kprintf("ic %d oc %d mic %d moc %d\n", ic,oc,max_ic,max_oc);
        }
        body += hdr->body_size;
    }

    (void)max_ic; // fix compiler warning.

    if(0x00 != ioc_mut) {
        //rt_kprintf("ioc_mut--:%d\n", (ioc_mut+max_oc)*sizeof(float));
        ctx->kmodel_fully_connected_buffer = (void *)rt_malloc_align((ioc_mut+max_oc)*sizeof(float), 8);
    }
}

int kpu_load_kmodel(kpu_model_context_t *ctx, const uint8_t *buffer)
{
    uintptr_t base_addr = (uintptr_t)buffer;
    const kpu_kmodel_header_t *header = (const kpu_kmodel_header_t *)buffer;

    if (header->version == 3 && header->arch == 0)
    {
        ctx->is_nncase = 0;
        ctx->model_buffer = buffer;
        ctx->output_count = header->output_count;
        ctx->outputs = (const kpu_model_output_t *)(base_addr + sizeof(kpu_kmodel_header_t));
        ctx->layer_headers = (const kpu_model_layer_header_t *)((uintptr_t)ctx->outputs + sizeof(kpu_model_output_t) * ctx->output_count);
        ctx->layers_length = header->layers_length;
        ctx->body_start = (const uint8_t *)((uintptr_t)ctx->layer_headers + sizeof(kpu_model_layer_header_t) * header->layers_length);
        ctx->kmodel_fully_connected_buffer = NULL;
        // ctx->main_buffer = (uint8_t *)malloc(header->main_mem_usage);
        ctx->main_buffer = (uint8_t *)rt_malloc_align(header->main_mem_usage, 8);
        if (!ctx->main_buffer)
            return -1;
        uint32_t body_size = 0;
        for(int i=0; i<ctx->layers_length; i++)
        {
            const kpu_model_layer_header_t *cnt_layer_header = ctx->layer_headers + i;
            body_size += cnt_layer_header->body_size;
        }
        kpu_prealloc_for_fully_conn_layer(ctx);
    } else if(header->version == 'KMDL')
    {
#if ONLY_KMODEL_V3
        rt_kprintf("Only support Kmodel V3\n");
        return -1;
#else
        return nncase_load_kmodel(ctx, buffer);
#endif // ONLY_KMODEL_V3
    } else
    {
        return -1;
    }

