kendryte/arduino-k210/cores/k210/k210-sdk/drivers/k210_kpu.c
    kpu_kmodel_header_t *header = (kpu_kmodel_header_t *)ctx->model_buffer;
    kpu->interrupt_clear.reg = 7;
    kpu->fifo_threshold.data = (kpu_config_fifo_threshold_t)
    {
        .fifo_full_threshold = 10, .fifo_empty_threshold = 1
    };
    kpu->eight_bit_mode.data = (kpu_config_eight_bit_mode_t)
    {
        .eight_bit_mode = header->flags & 1
    };
    kpu->interrupt_mask.data = (kpu_config_interrupt_t)
    {
        .calc_done_int = 1,
        .layer_cfg_almost_empty_int = 0,
        .layer_cfg_almost_full_int = 1
    };

    plic_set_priority(IRQN_AI_INTERRUPT, 1);
    plic_irq_register(IRQN_AI_INTERRUPT, ai_step, ctx);
    plic_irq_enable(IRQN_AI_INTERRUPT);

    const kpu_model_layer_header_t *first_layer_header = ctx->layer_headers;

    switch(first_layer_header->type)
    {
        case KL_K210_CONV:
        {
            const kpu_model_conv_layer_argument_t *first_layer = (const kpu_model_conv_layer_argument_t *)ctx->body_start;
            kpu_layer_argument_t layer_arg = *(volatile kpu_layer_argument_t *)(ctx->model_buffer + first_layer->layer_offset);

            if((layer_arg.image_size.data.i_row_wid + 1) % 64 != 0)
            {
                kpu_kmodel_input_with_padding(&layer_arg, src);
                ai_step_not_isr(ctx);
            } else
            {
                kpu_input_dma(&layer_arg, src, ctx->dma_ch, ai_step, ctx);
            }
        }
        break;
        case KL_FULLY_CONNECTED:
        {
            const kpu_model_fully_connected_layer_argument_t *first_layer = (const kpu_model_fully_connected_layer_argument_t *)ctx->body_start;
            kpu_kmodel_input_float((const float *)src, (float *)(ctx->main_buffer + first_layer->main_mem_in_address), first_layer->in_channels);
            ai_step_not_isr(ctx);
        }
        break;
        default:
            return -1;
    }

    return 0;
}

